configuration/src/InformationRegisters/ArchiveOfExchangeMessages/ArchiveOfExchangeMessages.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ArchiveOfExchangeMessages</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>FullFileName</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Store</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ReceivedMessageNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>FileName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FileExtention</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FileSize</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IsFileExceeds100MB</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>InfobaseNode</name>
    <comment>ACC:1330 универсальный механизм</comment>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ExchangeMessageArchiveSettings/ExchangeMessageArchiveSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ExchangeMessageArchiveSettings</name>
  <resources>
    <name>FilesCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>StoreOnDisk</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FullPath</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>FullPathLinux</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ShouldCompressFiles</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>InfobaseNode</name>
    <comment>ACC:1330 универсальный механизм</comment>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/DataExchangeResults/DataExchangeResults.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>DataExchangeResults</name>
  <resources>
    <name>OccurrenceDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Cause</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>IsSkipped</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>DeletionMark</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DocumentDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ObjectPresentation</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IndependentRegisterFiltersValues</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>IssueType</name>
    <type>
      <types>EnumRef.DataExchangeIssuesTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>InfobaseNode</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>MetadataObject</name>
    <type>
      <types>CatalogRef.ExtensionObjectIDs</types>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ObjectWithIssue</name>
    <type>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>UniqueKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/DataExchangeIssuesTypes/DataExchangeIssuesTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>DataExchangeIssuesTypes</name>
  <enumValues>
    <name>ApplicationAdministrativeError</name>
  </enumValues>
  <enumValues>
    <name>UnpostedDocument</name>
  </enumValues>
  <enumValues>
    <name>BlankAttributes</name>
  </enumValues>
  <enumValues>
    <name>HandlersCodeExecutionErrorOnSendData</name>
  </enumValues>
  <enumValues>
    <name>HandlersCodeExecutionErrorOnGetData</name>
  </enumValues>
  <enumValues>
    <name>ConvertedObjectValidationError</name>
  </enumValues>
  <enumValues>
    <name>IsExchangeMessageOutsideOfArchive</name>
  </enumValues>
</mdclass:Enum>

configuration/src/InformationRegisters/ArchiveOfExchangeMessages/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

Procedure PackMessageToArchive(InfobaseNode, PathToSourceFile) Export
	
	If Not ValueIsFilled(InfobaseNode) Then
		Return;
	EndIf;
	
	Settings = InformationRegisters.ExchangeMessageArchiveSettings.GetSettings(InfobaseNode);
	
	If Settings = Undefined Or Settings.FilesCount = 0 Then
		Return;
	EndIf;
	
	BeginTransaction();
	
	Try
		
		PutToArchive(InfobaseNode, PathToSourceFile, Settings);
		CommitTransaction();
		
	Except
		
		RollbackTransaction();
		
		ErrorMessage = ErrorProcessing.DetailErrorDescription(ErrorInfo());
		
		WriteLogEvent(EventLogEventMessagePutToArchive(),
			EventLogLevel.Error, , , ErrorMessage);
		
	EndTry;
	
EndProcedure 

#EndRegion

#Region Private

Procedure PutToArchive(InfobaseNode, PathToSourceFile, Settings)

	Block = New DataLock;
	LockItem = Block.Add("InformationRegister.ArchiveOfExchangeMessages");
	LockItem.SetValue("InfobaseNode", InfobaseNode);
	Block.Lock();
	
	Set = InformationRegisters.ArchiveOfExchangeMessages.CreateRecordSet();
	Set.Filter.InfobaseNode.Set(InfobaseNode);
	Set.Read();
	
	RecordsCount = Set.Count();
	For Cnt = 1 To RecordsCount Do
		
		IndexOf = RecordsCount - Cnt;
		Record = Set[IndexOf];
		If Record.IsFileExceeds100MB Then
			Set.Delete(IndexOf);
		EndIf;
		
	EndDo;
	
	For Cnt = 1 To Set.Count() - Settings.FilesCount + 1 Do
		
		Record = Set.Get(0);
		
		If Record.FullFileName <> "" Then
			DeleteFiles(Record.FullFileName);
		EndIf;
			
		Set.Delete(0);
		
	EndDo;
		
	If StrEndsWith(Lower(PathToSourceFile), "zip") Then
		FileExtention = "zip";
	Else
		FileExtention = "xml";
	EndIf;
	
	DeleteFileAfterPut = False;
	If Settings.ShouldCompressFiles And FileExtention <> "zip" Then
		
		DeleteFileAfterPut = True;
		FileExtention = "zip";
		FileName = GetTempFileName(FileExtention);
		
		DataExchangeServer.PackIntoZipFile(FileName, PathToSourceFile);
		
	Else
		
		FileName = PathToSourceFile;
		
	EndIf;
	
	File = New File(FileName);
	FileSize = File.Size() / (1024 * 1024); 
	
	Template = "%1_%2_%3";
	FileNameInArchive = StrTemplate(Template, 
		InfobaseNode.Code,
		InfobaseNode.ReceivedNo,
		String(New UUID));
	
	NewArchive = Set.Add();
	NewArchive.InfobaseNode = InfobaseNode;
	NewArchive.Period = CurrentSessionDate();
	NewArchive.ReceivedMessageNumber = InfobaseNode.ReceivedNo;
	NewArchive.FileSize = FileSize;
	NewArchive.FileName = FileNameInArchive;
	NewArchive.FileExtention = FileExtention;
	
	If Settings.StoreOnDisk Then
		
		Template = "%1%2.%3";
		
		FolderName = Settings.FullPath;
				
		FullFilenameInFolder = StringFunctions.FormattedString(Template,
			FolderName,
			FileNameInArchive,
			FileExtention);
			
		FileCopy(FileName, FullFilenameInFolder);
		NewArchive.FullFileName = FullFilenameInFolder;
			
	Else
				
		If Common.DataSeparationEnabled() And FileSize > 100 Then
			
			NewArchive.IsFileExceeds100MB = True;
			
			Cause = NStr("en = 'Exchange message larger than 100 MB. The file is not placed to the archive.';");
		
			WriteParameters = New Structure;
			WriteParameters.Insert("InfobaseNode", InfobaseNode);
			WriteParameters.Insert("Cause", Cause);
			WriteParameters.Insert("IssueType", Enums.DataExchangeIssuesTypes.IsExchangeMessageOutsideOfArchive);
			
			InformationRegisters.DataExchangeResults.AddAnEntryAboutTheResultsOfTheExchange(WriteParameters);
	
		Else
			
			NewArchive.Store = New ValueStorage(New BinaryData(FileName));
			
		EndIf;
		
	EndIf;
	
	If DeleteFileAfterPut Then
		DeleteFiles(FileName);
	EndIf;

	Set.Write();

EndProcedure

Function EventLogEventMessagePutToArchive()
	
	Return NStr("en = 'Data exchange.Place message to archive';", Common.DefaultLanguageCode());
	
EndFunction

#EndRegion

#EndIf
